How to get this list
http://stackoverflow.com/questions/13866848/how-to-save-a-list-of-all-the-installed-packages-in-emacs-24

in emacs type:
- C-h v package-activated-list
- remove erroneous '\'
- replace whitespace with newline
- sort
- uniq to remove duplicate lines, probably due to the dependency tree

(ac-c-headers
ac-dabbrev
ac-emmet
ac-etags
ac-geiser
ac-helm
ac-inf-ruby
ac-ispell
ac-js2
ac-math
ac-nrepl
ac-slime
ansi
anything
async
auctex
auctex-latexmk
auto-complete
autopair
cider
clojure-mode
commander
dash
ecukes
emmet-mode
epl
espuds
f
feature-mode
flycheck
geiser
gitignore-mode
haml-mode
helm
helm-core
inf-ruby
js2-mode
latex-preview-pane
let-alist
macrostep
markdown-mode
markdown-mode+
markdown-toc
math-symbol-lists
noflet
pcre2el
pkg-info
popup
queue
rsense
rubocop
ruby-electric
s
seq
simple-httpd
skewer-mode
slime
spinner
yari
yasnippet)
